terminal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-23 Thu 21:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Abdul Yahya" />
<link rel="stylesheet" type="text/css" href="ovrride.css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0f58787">1. ZSH Commands Cheatsheet, Tips, Tricks, Snippets, &amp; More!</a>
<ul>
<li><a href="#orgd9e097b">1.1. Detach processes</a></li>
<li><a href="#orgc5d80b5">1.2. Injecting Keystrokes in a script</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0f58787" class="outline-2">
<h2 id="org0f58787"><span class="section-number-2">1</span> ZSH Commands Cheatsheet, Tips, Tricks, Snippets, &amp; More!</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd9e097b" class="outline-3">
<h3 id="orgd9e097b"><span class="section-number-3">1.1</span> Detach processes</h3>
<div class="outline-text-3" id="text-1-1">
<p>
To detach a process running in the foreground use the press <span style='display: inline-block; margin: 0 .1rem; padding: .1rem .6rem; font-family: Arial,"Helvetica Neue",Helvetica,sans-serif; font-size: 11px; line-height: 1.4; color: #242729; text-shadow: 0 1px 0 #fff; background-color: #e4e6e8; border: 1px solid #9fa6ad; border-radius: 3px; box-shadow: 0 1px 1px rgba(12,13,14,0.15), inset 0 1px 0 0 #fff; white-space: nowrap;'>Ctrl</span> + <span style='display: inline-block; margin: 0 .1rem; padding: .1rem .6rem; font-family: Arial,"Helvetica Neue",Helvetica,sans-serif; font-size: 11px; line-height: 1.4; color: #242729; text-shadow: 0 1px 0 #fff; background-color: #e4e6e8; border: 1px solid #9fa6ad; border-radius: 3px; box-shadow: 0 1px 1px rgba(12,13,14,0.15), inset 0 1px 0 0 #fff; white-space: nowrap;'>Z</span>
this suspends the process. Then run <pre class='code__blk'>$ bg</pre> to unsuspend the process and run it in the background.
</p>

<p>
Another method of accomplishing the same thing is simply by appending an <pre class='code__blk'>&</pre> to the command you use to open your application.
So for example, let's say we want to open Emacs from our terminal but we want to retain the use of our session. To do this we would
use this command <pre class='code__blk'>$ emacs &</pre> or <pre class='code__blk'>$ emacs&</pre>.
</p>
</div>
</div>


<div id="outline-container-orgc5d80b5" class="outline-3">
<h3 id="orgc5d80b5"><span class="section-number-3">1.2</span> Injecting Keystrokes in a script</h3>
<div class="outline-text-3" id="text-1-2">
<p>
There are a few different methods of doing this. However, I want to keep it simple and without the use of 3rd party packages/applications.
All MacOS versions come with AppleScript which gives script kiddies like me, access to a <b>whole lot</b> of possibilites. One of those possibilities
being, keystrokes. Let's say we want our script to inject the keyboard command <span style='display: inline-block; margin: 0 .1rem; padding: .1rem .6rem; font-family: Arial,"Helvetica Neue",Helvetica,sans-serif; font-size: 11px; line-height: 1.4; color: #242729; text-shadow: 0 1px 0 #fff; background-color: #e4e6e8; border: 1px solid #9fa6ad; border-radius: 3px; box-shadow: 0 1px 1px rgba(12,13,14,0.15), inset 0 1px 0 0 #fff; white-space: nowrap;'>Ctrl</span> + <span style='display: inline-block; margin: 0 .1rem; padding: .1rem .6rem; font-family: Arial,"Helvetica Neue",Helvetica,sans-serif; font-size: 11px; line-height: 1.4; color: #242729; text-shadow: 0 1px 0 #fff; background-color: #e4e6e8; border: 1px solid #9fa6ad; border-radius: 3px; box-shadow: 0 1px 1px rgba(12,13,14,0.15), inset 0 1px 0 0 #fff; white-space: nowrap;'>z</span> somewhere in our script, here's
how we would do that:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #969896; font-style: italic;">#</span><span style="color: #969896; font-style: italic;">!/bin/</span><span style="color: #b9ca4a;">sh</span>

<span style="color: #b9ca4a;">function</span> <span style="color: #e78c45;">emac</span><span style="color: #eaeaea;">()</span> <span style="color: #eaeaea;">{</span>
  <span style="color: #c397d8;">echo</span> <span style="color: #70c0b1;">'Opening emacs'</span>
  emacs
  <span style="color: #c397d8;">echo</span> <span style="color: #70c0b1;">'Suspending emacs'</span>
  osascript -e <span style="color: #70c0b1;">'tell application "System Events" to keystroke "z" using control down'</span>
  <span style="color: #c397d8;">echo</span> <span style="color: #70c0b1;">'Emacs suspended succesfully'</span>
  <span style="color: #c397d8;">echo</span> <span style="color: #70c0b1;">'Unsuspending emacs and sending the process to run in the background'</span>
  osascript -e <span style="color: #70c0b1;">'tell application "System Events" to keystroke "bg"'</span>
  <span style="color: #c397d8;">echo</span> <span style="color: #70c0b1;">'Emacs process succesfully sent to background and started again.'</span>
<span style="color: #eaeaea;">}</span>

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Abdul Yahya</p>
<p class="date">Created: 2020-07-23 Thu 21:08</p>
<p class="validation"></p>
</div>
</body>
</html>
